; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image4 - mode
	infrared0 - mode
	spectrograph3 - mode
	infrared6 - mode
	spectrograph2 - mode
	infrared5 - mode
	thermograph1 - mode
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared6)
	(supports instrument0 image4)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared5)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument7 infrared5)
	(supports instrument7 infrared6)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite2 GroundStation1)
	(have_image Star7 thermograph1)
	(have_image Planet8 infrared5)
	(have_image Phenomenon9 spectrograph3)
	(have_image Star10 infrared0)
	(have_image Star10 thermograph1)
	(have_image Star11 infrared0)
	(have_image Star11 infrared6)
	(have_image Phenomenon12 image4)
	(have_image Phenomenon12 infrared6)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon13 spectrograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
2. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 13
3. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 13
4. (turn_to satellite0 star4 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star4)
   goals met: 0 of 13
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
6. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 13
7. (turn_to satellite0 star11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star11)
   goals met: 0 of 13
8. (take_image satellite0 star11 instrument0 infrared6)
   added: (have_image star11 infrared6)
   goals met: 1 of 13
9. (turn_to satellite0 phenomenon12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 13
10. (take_image satellite0 phenomenon12 instrument0 infrared6)
   added: (have_image phenomenon12 infrared6)
   goals met: 2 of 13
11. (take_image satellite0 phenomenon12 instrument0 image4)
   added: (have_image phenomenon12 image4)
   goals met: 3 of 13
12. (turn_to satellite0 groundstation0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 13
13. (take_image satellite1 phenomenon9 instrument3 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 4 of 13
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 13
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 13
16. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 13
17. (turn_to satellite0 phenomenon13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 13
18. (take_image satellite0 phenomenon13 instrument2 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 5 of 13
19. (take_image satellite0 phenomenon13 instrument2 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 6 of 13
20. (turn_to satellite0 star10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star10)
   goals met: 6 of 13
21. (take_image satellite0 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 7 of 13
22. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 7 of 13
23. (take_image satellite0 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 8 of 13
24. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 9 of 13
25. (take_image satellite0 planet8 instrument2 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 10 of 13
26. (turn_to satellite1 star10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star10)
   goals met: 10 of 13
27. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 11 of 13
28. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 11 of 13
29. (take_image satellite1 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 12 of 13
30. (turn_to satellite2 groundstation1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation1)
   goals met: 13 of 13
